TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СтатусыДопускаВагоновКВскрытию/гкс_СтатусыДопускаВагоновКВскрытию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СтатусыДопускаВагоновКВскрытию</name>
  <comment>ERP-2051</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВскрытиеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вагон</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопускКВскрытию</name>
    <type>
      <types>EnumRef.гкс_ДопускиКВскрытиюВагонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НахождениеВагоновНаПутяхСРПВ/гкс_НахождениеВагоновНаПутяхСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НахождениеВагоновНаПутяхСРПВ</name>
  <resources>
    <name>WaggonDispatchId</name>
    <type>
      <types>DefinedType.гкс_WagonDispatchID</types>
    </type>
  </resources>
  <resources>
    <name>WaggonIndexPark</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Вагон</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Путь</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ДополнительныеНастройкиНазначенияРазгрузки/гкс_ДополнительныеНастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ДополнительныеНастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиНазначенияРазгрузки/гкс_НастройкиНазначенияРазгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиНазначенияРазгрузки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Силос</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>ТочкаВъезда</name>
    <comment>Точка въезда</comment>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <comment>ERP-1377</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ДопускиКВскрытиюВагонов/гкс_ДопускиКВскрытиюВагонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ДопускиКВскрытиюВагонов</name>
  <comment>ERP-2051</comment>
  <enumValues>
    <name>Фумигационный</name>
  </enumValues>
  <enumValues>
    <name>Фитосанитарный</name>
  </enumValues>
  <enumValues>
    <name>Претензионный</name>
  </enumValues>
  <enumValues>
    <name>Ветеринарный</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаЖДПеревозки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборВидПеревозки 	= Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	
	ИнициализироватьРеквизитыФормы();
	ИнициализироватьЭлементыФормы();
	УстановитьВидимостьДоступностьЭлементовФормы();
	УстановитьВидимостьДоступностьПропуститьКонтрольКачества();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	Если ЗначениеЗаполнено(ОтборТочкаМаршрута) Тогда
		
		УстановитьОтборыСпискаРегистрации();
		УстановитьВидимостьЭлементовСпискаРегистрации();
		УстановитьВидимостьДоступностьКомандФормы();
		
	Иначе 
		
		ШаблонСообщения = НСтр("ru = 'Не определена рабочая точка маршрута! %1'"); 
		Если ИспользоватьНесколькоАЛЦ Тогда
			ТекстУточнениея = НСтр("ru = 'Проверьте ""Настройки ролей пользователей приемки транспорта""'");
		Иначе
			ТекстУточнениея = НСтр("ru = 'Проверьте константу ""Точка маршрута базы""'");
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекстУточнениея);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ОтборТочкаМаршрута");
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипРегистрацииПриИзменении(Элемент)

	ПриИзмененииФильтра();
	УстановитьЗаголовкиЭлементовПоТипуРегистрации(ОтборТипРегистрации);
	УстановитьВидимостьДоступностьКомандФормы();
	УстановитьВидимостьЭлементовСпискаРегистрации();
	
	ТипРегистрацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТочкаМаршрутаПриИзменении(Элемент)
	
	ПриИзмененииФильтра();
	УстановитьВидимостьЭлементовСпискаРегистрации();
	ОтборТочкаМаршрутаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	ПриИзмененииФильтра();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТранспортПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборТранспорт) Тогда
		ОтборНомерТС = "";
	КонецЕсли;
	ПриИзмененииФильтра();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрНомерТСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборНомерТС) Тогда
		ОтборТранспорт = Неопределено;
	КонецЕсли;
	ПриИзмененииФильтра();
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовСтраницыВагоныНаПутях

&НаКлиенте
Процедура ВагоныНаПЛКВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Область.Расшифровка) Тогда 
		Возврат;
	КонецЕсли;
	
	ИсточникКлюча = КлючСтрокиСпискаРегистраций(Область.Расшифровка);
	Если Не ИсточникКлюча = Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		Элементы.СписокРегистрации.ТекущаяСтрока = Новый КлючСтрокиДинамическогоСписка(ИсточникКлюча);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРегистрации

&НаКлиенте
Процедура СписокРегистрацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокРегистрацииПометка Тогда	
		
		ТекущиеДанные.Пометка = Не ТекущиеДанные.Пометка;
		УстановитьПометку(ТекущиеДанные.Пометка, ТекущиеДанные.ДокументРегистрации);
		
		ОбновитьПараметрыСпискаРегистраций();
		
	ИначеЕсли Поле = Элементы.СписокРегистрацииНомер Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.ДокументРегистрации);
	
	ИначеЕсли Поле = Элементы.СписокРегистрацииДоговор Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.Спецификация);
	
	ИначеЕсли Поле = Элементы.СписокРегистрацииНомерДокументаПоставщика Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.ТранспортныйДокумент);
			
	ИначеЕсли Поле = Элементы.СписокРегистрацииСтанцияЖДНаименованиеПолное Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.СтанцияЖД);
		
	Иначе
		Возврат; // Исправление замечаний SonarQube
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокРегистрацииПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжиданияОбновления(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрибытиеВагонов

&НаКлиенте
Процедура ПрибытиеВагоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ПрибытиеВагоновТранспортныйДокумент" Тогда
		ПоказатьЗначениеВДиалоге(ТекущиеДанные.ТранспортныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДопускФумигационный(Команда)
	ИзменитьДопуск(ПредопределенноеЗначение("Перечисление.гкс_ДопускиКВскрытиюВагонов.Фумигационный"));
КонецПроцедуры

&НаКлиенте
Процедура ДопускФитосанитарный(Команда)
	ИзменитьДопуск(ПредопределенноеЗначение("Перечисление.гкс_ДопускиКВскрытиюВагонов.Фитосанитарный"));
КонецПроцедуры

&НаКлиенте
Процедура ДопускПретензионный(Команда)
	ИзменитьДопуск(ПредопределенноеЗначение("Перечисление.гкс_ДопускиКВскрытиюВагонов.Претензионный"));
КонецПроцедуры

&НаКлиенте
Процедура ДопускВетеринарный(Команда)
	ИзменитьДопуск(ПредопределенноеЗначение("Перечисление.гкс_ДопускиКВскрытиюВагонов.Ветеринарный"));
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПричинуПретензионности(Команда)
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.Претензионный Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("Вагон", 				ТекущиеДанные.ТранспортноеСредство); 
	ПараметрыСтроки.Вставить("ДокументРегистрации", ТекущиеДанные.ДокументРегистрации);	
	
	ТекстПричины = ПолучитьПричинуПретензионности(ПараметрыСтроки);
	
	ПоказатьЗначение(, ТекстПричины);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	УстановитьПометку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВагоныНаПЛК(Команда)
	НачатьВыводИнформацииОВагонахНаПЛК();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьЗначениеВДиалоге(Значение)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(Неопределено, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФильтра()
	УстановитьОтборыСпискаРегистрации();
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Пометка, РегистрацияНаПЛК = Неопределено)

	Если ЗначениеЗаполнено(РегистрацияНаПЛК) Тогда // Единичный выбор в списке
		гкс_ПриемкаТранспортаСлужебныйКлиент.ОбработатьИзменениеПометкиДляОднойСтроки(
			Пометка, РегистрацииВыбранные, РегистрацияНаПЛК);
	Иначе
		
		Если Пометка Тогда 
			РегистрацииГрупповойОбработки = РегистрацииГрупповойОбработки();
			РегистрацииВыбранные.ЗагрузитьЗначения(РегистрацииГрупповойОбработки);
		Иначе 
			РегистрацииВыбранные.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжиданияОбновления(Истина, Истина);

КонецПроцедуры

#Область Инициалиализация

&НаСервере
Процедура ИнициализироватьЭлементыФормы()
	
	ОбновитьНаправленияРазгрузки();

КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ИнициализироватьЗаголовокФормы();
	ИнициализироватьТекущегоПользователя();
	ИнициализироватьРеквизитыОтбора();
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьСтруктуруДоступов(ЭтотОбъект);
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьРеквизитыПравПользователя(ЭтотОбъект);
	
	ИнициализироватьРеквизитыПриемкиЖД();
	ИнициализироватьРеквизитыВремяОжиданияТС();
	ИнициализироватьАвтоматическоеФормированиеДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗаголовокФормы()
	
	Если Параметры.Свойство("АвтоПриемка") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Рабочее место ""Приемка и отгрузка на ПЛК"": ЖД транспорт'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТекущегоПользователя()
	
	Пользователь = Пользователи.ТекущийПользователь();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
КонецПроцедуры
 
&НаСервере
Процедура ИнициализироватьРеквизитыОтбора()
	
	Если Параметры.Свойство("АвтоПриемка") Тогда
		ОтборТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка;
	КонецЕсли;
	гкс_ПриемкаТранспортаСлужебный.ИнициализироватьОтборТочкаМаршрута(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыПриемкиЖД()
	
	РазрешитьВходнойКонтрольДоВзвешивания = гкс_ПриемкаТранспорта.
		РазрешитьВходнойКонтрольДоВзвешивания(ОтборТипРегистрации, ОтборВидПеревозки);
			
КонецПроцедуры	

&НаСервере
Процедура ИнициализироватьРеквизитыВремяОжиданияТС()
	
	Если ЗначениеЗаполнено(ОтборТочкаМаршрута) Тогда
		ЧасовойПоясПЛК = гкс_ПриемкаТранспортаВызовСервера.ЧасовойПоясПЛК(ОтборТочкаМаршрута);
	КонецЕсли; 
	
КонецПроцедуры
  
&НаСервере
Процедура ИнициализироватьАвтоматическоеФормированиеДокументов()
	
	АвтоматическоеФормированиеДокументов = 
		гкс_РаботаСНастройками.ЕстьАвтоматическоеФормированиеДокументовДляТочкиМаршрута(ОтборТочкаМаршрута);

КонецПроцедуры

#КонецОбласти 

#Область ВидимостьДоступность

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
		
	УстановитьВидимостьДоступностьИныхЭлементовФормы();
	УстановитьВидимостьДоступностьПринятыеТС();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьИныхЭлементовФормы()
	
	УстановленОтборТочкаМаршрута 	= ЗначениеЗаполнено(ОтборТочкаМаршрута);
	УстановленОтборВидПеревозки 	= ЗначениеЗаполнено(ОтборВидПеревозки);
	
	Элементы.ГруппаОсновная.Видимость 	= УстановленОтборТочкаМаршрута И УстановленОтборВидПеревозки; 
	Элементы.ГруппаГлавная.Видимость 	= УстановленОтборТочкаМаршрута И УстановленОтборВидПеревозки;
	
	Элементы.КачественныеПоказателиУсиленныйКонтроль.Видимость 
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества");
	
	Элементы.СписокРегистрацииЗаблокировано.Видимость 
		= ПолучитьФункциональнуюОпцию("гкс_ИспользоватьЗаблокированныеТС");	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьПринятыеТС()
	
	ЕстьПравоНаЗПП3 = ЕстьПравоНаРедактирование("гкс_РеестрНакладныхЗПП3");
	Элементы.ГруппаПринятыеТС.Видимость = ЕстьПравоНаЗПП3;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьКомандФормы()
		
	Элементы.СписокРегистрацииДопускФумигационный.Видимость 	= СтруктураДоступов.ДоступенДопускФумигационный;
	Элементы.СписокРегистрацииДопускФитосанитарный.Видимость 	= СтруктураДоступов.ДоступенДопускФитосанитарный;
	Элементы.СписокРегистрацииДопускПретензионный.Видимость 	= СтруктураДоступов.ДоступенДопускПретензионный;
	Элементы.СписокРегистрацииДопускВетеринарный.Видимость 		= СтруктураДоступов.ДоступенДопускВетеринарный;
	
	Элементы.ПодменюДопуски.Видимость = СтруктураДоступов.ДоступенДопускаКВскрытиюВагонов;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьВидимостьДоступностьКомандФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьПропуститьКонтрольКачества()
	
	ЭтоПриемкаТранспорта = гкс_ПриемкаТранспортаКлиентСервер.ЭтоПриемкаТранспорта(ОтборТипРегистрации);
	Элементы.СписокРегистрацииПропуститьКонтрольКачества.Видимость = 
		ЭтоПриемкаТранспорта;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовСпискаРегистрации()
	
	Элементы.СписокРегистрацииТочкаМаршрута.Видимость = Не ЗначениеЗаполнено(ОтборТочкаМаршрута);
	
КонецПроцедуры

#КонецОбласти 

#Область РаботаСДопускамиЖДПеревозок

&НаКлиенте
Процедура ИзменитьДопуск(ТипДопуска)
	
	Если Не гкс_ПриемкаТранспортаКлиентСервер.ЭтоПриемкаТранспорта(ОтборТипРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	ВыбранныеРегистрации = РегистрацииВыбранные.ВыгрузитьЗначения();
	Если ВыбранныеРегистрации.Количество() = 0 Тогда
		
		Если ТекущиеДанные <> Неопределено  Тогда
			ВыбранныеРегистрации.Добавить(ТекущиеДанные.ДокументРегистрации);
		Иначе
			ТекстСообщения = НСтр("ru='Необходимо выбрать строки.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеВскрытиеЗапрещено = СтатусДопускаВВыбранныхСтроках(ВыбранныеРегистрации, ТипДопуска);
	Если Не ЗначениеВскрытиеЗапрещено = Неопределено Тогда
		НовоеЗначениеВскрытиеЗапрещено = Не ЗначениеВскрытиеЗапрещено;
	Иначе
		НовоеЗначениеВскрытиеЗапрещено = Истина;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДопуска", ТипДопуска);
	ПараметрыФормы.Вставить("ВыбранныеРегистрации", ВыбранныеРегистрации);
	ПараметрыФормы.Вставить("НовоеЗначение", НовоеЗначениеВскрытиеЗапрещено);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьДопускЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.гкс_ПриемкаТранспорта.Форма.ИзменениеДопускаТранспорта",
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , , 
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДопускЗавершение(Комментарий, ДополнительныеПараметры) Экспорт
	ПодключитьОбработчикОжиданияОбновления(Истина, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбратныеВызовы

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияОбновления(Подключать = Истина, Однократно = Истина)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ПодключитьОбработчикОжиданияОбновления(ЭтотОбъект, Подключать, Однократно);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаЯмРазгрузки_Завершение(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьНаправленияРазгрузки();
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеДоступностиКомандУправленияРегистрацейПоТекущемуСостоянию

#Область ОбщиеПроцедурыУправленияДоступностьюКомандамиРегистрации

&НаКлиенте
Процедура УстановитьДоступностьКнопокУправленияПоУмолчанию()
	
	Элементы.СписокРегистрацииДопускФумигационный.Доступность 	= Ложь;
	Элементы.СписокРегистрацииДопускФитосанитарный.Доступность 	= Ложь;
	Элементы.СписокРегистрацииДопускПретензионный.Доступность 	= Ложь;
	Элементы.СписокРегистрацииДопускВетеринарный.Доступность 	= Ложь;
	Элементы.СписокРегистрацииКонтекстноеМенюПричинаПретензионности.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандУправленияДопусками()

	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЭтоПриемкаТранспорта = гкс_ПриемкаТранспортаКлиентСервер.ЭтоПриемкаТранспорта(ОтборТипРегистрации);

	Элементы.СписокРегистрацииДопускФумигационный.Доступность 	= ЭтоПриемкаТранспорта;
	Элементы.СписокРегистрацииДопускФитосанитарный.Доступность 	= ЭтоПриемкаТранспорта;
	Элементы.СписокРегистрацииДопускПретензионный.Доступность 	= ЭтоПриемкаТранспорта;
	Элементы.СписокРегистрацииДопускВетеринарный.Доступность 	= ЭтоПриемкаТранспорта;
	
	Элементы.СписокРегистрацииКонтекстноеМенюПричинаПретензионности.Доступность = 
		ЭтоПриемкаТранспорта И ТекущиеДанные.Претензионный;

	Элементы.СписокРегистрацииПропуститьКонтрольКачества.Доступность 
		= ЕстьПравоНаРедактированиеПриемкаТранспортаБезВходногоКонтроля;
	
КонецПроцедуры 
	
#КонецОбласти

&НаКлиенте
Процедура ОбновитьКнопки(ТекущиеДанные)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьДоступностьКнопокУправленияПоУмолчанию(ЭтотОбъект);
	УстановитьДоступностьКнопокУправленияПоУмолчанию();
	Если Не (ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Состояние")) Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ОбновитьКнопки(ЭтотОбъект, ТекущиеДанные);
	
	УстановитьДоступностьКомандУправленияДопусками();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды 
// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Элементы.СписокРегистрации.ТекущиеДанные <> Неопределено Тогда
		
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, 
			Элементы.СписокРегистрации.ТекущиеДанные.ДокументРегистрации);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокРегистрации);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

#Область ДекорацииНазначенийРазгрузки

&НаСервере
Процедура ОбновитьНаправленияРазгрузки()
	
	гкс_ПриемкаТранспортаСлужебный.ОбновитьНаправленияРазгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область Прочее

&НаСервереБезКонтекста
Функция ПолучитьПричинуПретензионности(ПараметрыСтроки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вагон", ПараметрыСтроки.Вагон);
	Запрос.УстановитьПараметр("ДокументРегистрации", ПараметрыСтроки.ДокументРегистрации);
	Запрос.УстановитьПараметр("ДопускКВскрытию", Перечисления.гкс_ДопускиКВскрытиюВагонов.Претензионный);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СтатусыДопускаВагоновСрезПоследних.Комментарий КАК СТРОКА(500)) КАК Комментарий
	|ИЗ
	|	РегистрСведений.гкс_СтатусыДопускаВагоновКВскрытию.СрезПоследних(
	|			&Период,
	|			ДокументРегистрации = &ДокументРегистрации
	|				И Вагон = &Вагон
	|				И ДопускКВскрытию = &ДопускКВскрытию) КАК СтатусыДопускаВагоновСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекстПричины = Выборка.Комментарий;
	Иначе		
		ТекстПричины = НСтр("ru = 'Комментарий пустой'");
	КонецЕсли;
	
	Возврат ТекстПричины;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеНаФорме()
	
	ОбновитьПараметрыСпискаРегистраций();
	Элементы.СписокРегистрации.Обновить();
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Если ТекущиеДанные.Свойство("ТипРегистрации")
		И Не ОтборТипРегистрации = ТекущиеДанные.ТипРегистрации Тогда
			
		УстановитьЗаголовкиЭлементовПоТипуРегистрации(ТекущиеДанные.ТипРегистрации);
	КонецЕсли;
	
	ОбновитьКнопки(ТекущиеДанные);
	
	Подключаемый_ОбновитьДетальныеЗаписиРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиЭлементовПоТипуРегистрации(ТипРегистрацииТранспорта)
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьЗаголовкиЭлементовПоТипуРегистрации(
		ЭтотОбъект, ТипРегистрацииТранспорта);
	
КонецПроцедуры

#Область РаботаСОкномДетальныеЗаписиРегистраций

&НаКлиенте
Процедура Подключаемый_ОбновитьДетальныеЗаписиРегистрации()
	
	Если Не РежимПросмотраДетальныхЗаписей Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокРегистрации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ТекущиеДанные);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ТекущиеДанные)
	
	гкс_ПриемкаТранспортаСлужебный.ЗаполнитьДетальныеЗаписиРегистрацииНаСервере(ЭтотОбъект, ТекущиеДанные);
	ДоставкаСообщенийОписаниеОшибки	= ТекущиеДанные.ДоставкаСообщенийОписаниеОшибки;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыОтборыСпискаРегистраций

&НаКлиенте
Процедура УстановитьОтборыСпискаРегистрации()
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.УстановитьОбщиеОтборыСпискаРегистрации(ЭтотОбъект);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРегистрации,
		"СтанцияЖД", ОтборСтанцияЖД, ВидСравненияКомпоновкиДанных.Равно,, 
		ЗначениеЗаполнено(ОтборСтанцияЖД));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокРегистрации,
		"СцепкаПуть", ОтборПуть, ВидСравненияКомпоновкиДанных.ВСписке,, 
		ЗначениеЗаполнено(ОтборПуть));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыСпискаРегистраций()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРегистрации, 
		"РегистрацииВыбранные", РегистрацииВыбранные.ВыгрузитьЗначения());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ТипРегистрацииПриИзмененииНаСервере()
	
	ИнициализироватьРеквизитыПриемкиЖД();
	УстановитьВидимостьДоступностьПропуститьКонтрольКачества();
	
КонецПроцедуры

&НаСервере
Процедура ОтборТочкаМаршрутаПриИзмененииНаСервере()
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	ИнициализироватьРеквизитыВремяОжиданияТС();
	ИнициализироватьАвтоматическоеФормированиеДокументов();
	
	ОбновитьНаправленияРазгрузки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПравоНаРедактирование(ИмяОбъекта)
	Возврат ПравоДоступа("Добавление", Метаданные.Документы[ИмяОбъекта]);
КонецФункции

&НаСервереБезКонтекста
Функция СтатусДопускаВВыбранныхСтроках(ВыбранныеРегистрации, ТипДопуска)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СписокРегистраций", ВыбранныеРегистрации);
	Запрос.УстановитьПараметр("ДопускКВскрытию", ТипДопуска);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтатусыДопускаВагоновКВскрытию.ВскрытиеЗапрещено КАК ВскрытиеЗапрещено
	|ИЗ
	|	РегистрСведений.гкс_СтатусыДопускаВагоновКВскрытию.СрезПоследних(
	|			,
	|			ДокументРегистрации В (&СписокРегистраций)
	|				И ДопускКВскрытию = &ДопускКВскрытию) КАК СтатусыДопускаВагоновКВскрытию";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
 		Выборка.Следующий();
		Результат = Выборка.ВскрытиеЗапрещено;
	Иначе
		
		ТекстСообщения = НСтр("ru = 'В выбранных строках у допуска ""%1"" установлены разные значения. 
							  |Не возможно применить групповую операцию.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТипДопуска); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Результат = Неопределено;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РегистрацииГрупповойОбработки()
	Возврат гкс_ПриемкаТранспортаСлужубныйВызовСервера.РегистрацииГрупповойОбработки(ЭтотОбъект);
КонецФункции

&НаСервереБезКонтекста
Функция КлючСтрокиСпискаРегистраций(ДокументРегистрации)
	
	ИсточникКлюча = Неопределено;
	Если ТипЗнч(ДокументРегистрации) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда 
		РеквизитыРегистрации = Новый Структура;
		РеквизитыРегистрации.Вставить("ВидПеревозки"		, "ВидПеревозки");
		РеквизитыРегистрации.Вставить("ДокументРегистрации"	, "Ссылка");
		РеквизитыРегистрации.Вставить("ТипРегистрации"		, "ТипРегистрации");
		РеквизитыРегистрации.Вставить("ТочкаМаршрута"		, "ТочкаМаршрута");
		ИсточникКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, РеквизитыРегистрации); 
	КонецЕсли;
	
	Возврат ИсточникКлюча;
	
КонецФункции

#Область ВагоныНаПЛК

&НаСервере
Процедура НачатьВыводИнформацииОВагонахНаПЛК()
	
	Обработка 		= РеквизитФормыВЗначение("Объект");
	Макет 			= Обработка.ПолучитьМакет("ВагоныНаПутях");
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("ОбластьЗаголовок"	, Макет.ПолучитьОбласть("ИтогиЗаголовок"));
	ОбластиМакета.Вставить("ОбластьИтогиШапка"	, Макет.ПолучитьОбласть("ИтогиШапка"));
	ОбластиМакета.Вставить("ОбластьИтогиСтрока"	, Макет.ПолучитьОбласть("ИтогиСтрока"));
	ОбластиМакета.Вставить("ОбластьПуть"		, Макет.ПолучитьОбласть("Путь|КолонкаПуть"));
	ОбластиМакета.Вставить("ОбластьВагон"		, Макет.ПолучитьОбласть("Путь|КолонкаВагон"));
	ОбластиМакета.Вставить("ОбластьОтступ"		, Макет.ПолучитьОбласть("Путь|КолонкаОтступ"));
	ОбластиМакета.Вставить("ОбластьРазделитель"	, Макет.ПолучитьОбласть("Разделитель"));
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Неинициализировано"	, "Неизвестно");
	Запрос.УстановитьПараметр("ТочкаМаршрута"		, ОтборТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки"		, ОтборВидПеревозки);
	ТаблицыЗапроса	= ТаблицыЗапросаВыводаИнформацииОВагонахНаПЛК();
	Запрос.Текст 	= ТекстЗапросаВыводаИнформацииОВагонахНаПЛК();
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВагоныНаПЛК.ФиксацияСлева = 1;
	ВагоныНаПЛК.Очистить();
	
	// Заголовок
	ВывестиЗаголовокДляВагоновНаПЛК(ОбластиМакета, РезультатЗапроса, ТаблицыЗапроса);
	
	// Пути-Вагоны
	ВывестиПутиДляВагоновНаПЛК(ОбластиМакета, РезультатЗапроса, ТаблицыЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЗаголовокДляВагоновНаПЛК(ОбластиМакета, РезультатЗапроса, ТаблицыЗапроса)
	
	УровеньОбластьЗаголовок = 1;
	УровеньОбластьИтоги 	= 2;
	ВагоныНаПЛК.НачатьАвтоГруппировкуСтрок();
	ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьЗаголовок, УровеньОбластьЗаголовок, "ИтогиЗаголовок", Ложь);
	ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьИтогиШапка, УровеньОбластьИтоги, "ИтогиШапка");
	
	ИтоговыеЗаписи 		= РезультатЗапроса[ТаблицыЗапроса.НоменклатураИтоги].Выгрузить();
	ИтогиПоСостоянию 	= РезультатЗапроса[ТаблицыЗапроса.СостоянияИтоги].Выгрузить();
	Для НПП = 0 По ИтогиПоСостоянию.Количество() - 1 Цикл 
		
		Если НПП >= ИтоговыеЗаписи.Количество() Тогда 
			СтрокаИтогов = ИтоговыеЗаписи.Добавить();
		Иначе 
			СтрокаИтогов = ИтоговыеЗаписи[НПП];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаИтогов, ИтогиПоСостоянию[НПП]);
		
	КонецЦикла;
	
	ОбластьИтогиСтрока = ОбластиМакета.ОбластьИтогиСтрока;
	Для Каждого СтрокаИтогов Из ИтоговыеЗаписи Цикл 
		
		ОбластьИтогиСтрока.Параметры.Заполнить(СтрокаИтогов);
		ВагоныНаПЛК.Вывести(ОбластьИтогиСтрока, УровеньОбластьИтоги, "ИтогиСтрока");
		ОформлениеОбласти = ОформлениеВагонаПоСостоянию(СтрокаИтогов.Состояние);
		ОбластьНомерСтроки 	= ВагоныНаПЛК.ВысотаТаблицы;
		ОбластьНомерКолонки	= 4;
		Область = ВагоныНаПЛК.Область(
			ОбластьНомерСтроки, ОбластьНомерКолонки, ОбластьНомерСтроки, ОбластьНомерКолонки);
		ОформитьОбластьВагоновНаПЛК(Область, ОформлениеОбласти);
		
	КонецЦикла;
	
	ВагоныНаПЛК.ЗакончитьАвтогруппировкуСтрок();
	ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьРазделитель);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПутиДляВагоновНаПЛК(ОбластиМакета, РезультатЗапроса, ТаблицыЗапроса)
	
	ВагоныНаПЛК.НачатьАвтогруппировкуСтрок();
	
	ВыборкаПуть = РезультатЗапроса[ТаблицыЗапроса.ВагоныНаПутяхИтоги].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПуть.Следующий() Цикл
		
		// Путь
		ОбластиМакета.ОбластьПуть.Параметры.Заполнить(ВыборкаПуть);
		ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьПуть, ВыборкаПуть.Уровень());
		ВыборкаДетальныеЗаписи = ВыборкаПуть.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Вагон
			ОбластиМакета.ОбластьВагон.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластиМакета.ОбластьВагон.Параметры.ВагонПозиция = СтрШаблон(
				"%1/%2", ВыборкаДетальныеЗаписи.WaggonIndexPark, ВыборкаПуть.WaggonIndexPark);
			
			ОформлениеОбласти = ОформлениеВагонаПоСостоянию(ВыборкаДетальныеЗаписи.Состояние);
			Область = ВагоныНаПЛК.Присоединить(ОбластиМакета.ОбластьВагон, ВыборкаДетальныеЗаписи.Уровень());
			ОформитьОбластьВагоновНаПЛК(Область, ОформлениеОбласти);
			
			ВагоныНаПЛК.Присоединить(ОбластиМакета.ОбластьОтступ, ВыборкаДетальныеЗаписи.Уровень());
			
		КонецЦикла;
		
		ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьРазделитель);
		// {Разделить пути
		Область = ВагоныНаПЛК.Область(ВагоныНаПЛК.ВысотаТаблицы, , ВагоныНаПЛК.ВысотаТаблицы);
		Область.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
		// Разделить пути}
		ВагоныНаПЛК.Вывести(ОбластиМакета.ОбластьРазделитель);
		
	КонецЦикла;
	
	ВагоныНаПЛК.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ОформитьОбластьВагоновНаПЛК(Область, ОформлениеОбласти)
	Область.ЦветФона = ОформлениеОбласти.ЦветФона;
	Область.ЦветРамки = ОформлениеОбласти.ЦветРамки;
	Область.Обвести(
		ОформлениеОбласти.Линия, ОформлениеОбласти.Линия, ОформлениеОбласти.Линия, ОформлениеОбласти.Линия);
КонецПроцедуры

&НаСервере
Функция ТаблицыЗапросаВыводаИнформацииОВагонахНаПЛК()
	
	ТаблицыЗапроса = Новый Структура;
	ТаблицыЗапроса.Вставить("ВагоныНаПутях", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ВагоныНаПутяхРегистрации", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("СостоянияРегистрации", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("НастройкиНазначенияРазгрузкиОбщие", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("НастройкиНазначенияРазгрузки", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ВагоныНаПутяхДетальные", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ВагоныНаПутяхИтоги", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("НоменклатураИтоги", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("СостоянияИтоги", ТаблицыЗапроса.Количество());
	Возврат ТаблицыЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаВыводаИнформацииОВагонахНаПЛК()
	
	Возврат
	"ВЫБРАТЬ
	|	НахождениеВагоновНаПутяхСРПВ.Вагон КАК Вагон,
	|	НахождениеВагоновНаПутяхСРПВ.Путь КАК Путь,
	|	НахождениеВагоновНаПутяхСРПВ.WaggonIndexPark КАК WaggonIndexPark,
	|	ЕСТЬNULL(СтруктураПЛК.ТочкаМаршрута, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК ПутьТочкаМаршрута,
	|	ЕСТЬNULL(КлючиАналитикиСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_КлючиАналитикиСРПВ.ПустаяСсылка)) КАК КлючАналитики
	|ПОМЕСТИТЬ ВагоныНаПутях
	|ИЗ
	|	РегистрСведений.гкс_НахождениеВагоновНаПутяхСРПВ КАК НахождениеВагоновНаПутяхСРПВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КлючиАналитикиСРПВ КАК КлючиАналитикиСРПВ
	|		ПО НахождениеВагоновНаПутяхСРПВ.WaggonDispatchId = КлючиАналитикиСРПВ.ИдентификаторОтправкиВагона
	|		И КлючиАналитикиСРПВ.ТипОперации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|		ПО НахождениеВагоновНаПутяхСРПВ.Путь = СтруктураПЛК.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаПутях.Вагон КАК Вагон,
	|	ВагоныНаПутях.Путь КАК Путь,
	|	ВагоныНаПутях.ПутьТочкаМаршрута КАК ПутьТочкаМаршрута,
	|	ВагоныНаПутях.WaggonIndexPark КАК WaggonIndexPark,
	|	ЕСТЬNULL(ДокументыРегистрацияНаПЛК.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_РегистрацияНаПЛК.ПустаяСсылка)) КАК
	|		ДокументРегистрации,
	|	ЕСТЬNULL(ДокументыРегистрацияНаПЛК.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ДокументыРегистрацияНаПЛК.Номенклатура.НаименованиеПолное, &Неинициализировано) КАК НоменклатураНаименование
	|ПОМЕСТИТЬ ВагоныНаПутяхРегистрации
	|ИЗ
	|	ВагоныНаПутях КАК ВагоныНаПутях
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_СРПВПрибытиеНаПуть КАК СРПВПрибытиеНаПуть
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК ДокументыРегистрацияНаПЛК
	|			ПО СРПВПрибытиеНаПуть.Ссылка = ДокументыРегистрацияНаПЛК.ДокументОснование
	|		ПО ВагоныНаПутях.КлючАналитики = СРПВПрибытиеНаПуть.ИдентификаторОтправки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостоянияРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ДокументРегистрации В
	|		(ВЫБРАТЬ
	|			ВагоныНаПутяхРегистрации.ДокументРегистрации
	|		ИЗ
	|			ВагоныНаПутяхРегистрации КАК ВагоныНаПутяхРегистрации)) КАК СостоянияРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиНазначенияРазгрузки.Номенклатура КАК Номенклатура,
	|	НастройкиНазначенияРазгрузки.Силос КАК Силос,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки
	|ПОМЕСТИТЬ НастройкиНазначенияРазгрузкиОбщие
	|ИЗ
	|	РегистрСведений.гкс_ДополнительныеНастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиНазначенияРазгрузки.Номенклатура,
	|	НастройкиНазначенияРазгрузки.Силос,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки
	|ИЗ
	|	РегистрСведений.гкс_НастройкиНазначенияРазгрузки.СрезПоследних(, ТочкаМаршрута = &ТочкаМаршрута
	|	И ВидПеревозки = &ВидПеревозки) КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	НастройкиНазначенияРазгрузки.Действует
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ЯмаРазгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиНазначенияРазгрузки.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(НастройкиНазначенияРазгрузки.Силос) КАК Силос,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки
	|ПОМЕСТИТЬ НастройкиНазначенияРазгрузки
	|ИЗ
	|	НастройкиНазначенияРазгрузкиОбщие КАК НастройкиНазначенияРазгрузки
	|ГДЕ
	|	(НастройкиНазначенияРазгрузки.Номенклатура, НастройкиНазначенияРазгрузки.ЯмаРазгрузки) В
	|		(ВЫБРАТЬ
	|			ВагоныНаПутяхРегистрации.Номенклатура,
	|			ВагоныНаПутяхРегистрации.ПутьТочкаМаршрута
	|		ИЗ
	|			ВагоныНаПутяхРегистрации)
	|СГРУППИРОВАТЬ ПО
	|	НастройкиНазначенияРазгрузки.Номенклатура,
	|	НастройкиНазначенияРазгрузки.ЯмаРазгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаПутяхРегистрации.Вагон КАК Вагон,
	|	ВагоныНаПутяхРегистрации.Путь КАК Путь,
	|	ВагоныНаПутяхРегистрации.WaggonIndexPark КАК WaggonIndexPark,
	|	ВагоныНаПутяхРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ВагоныНаПутяхРегистрации.Номенклатура КАК Номенклатура,
	|	ВагоныНаПутяхРегистрации.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ЕСТЬNULL(СостоянияРегистрации.Состояние, &Неинициализировано) КАК Состояние,
	|	ЕСТЬNULL(НастройкиНазначенияРазгрузки.Силос, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК Силос
	|ПОМЕСТИТЬ ВагоныНаПутяхДетальные
	|ИЗ
	|	ВагоныНаПутяхРегистрации КАК ВагоныНаПутяхРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияРегистрации КАК СостоянияРегистрации
	|		ПО ВагоныНаПутяхРегистрации.ДокументРегистрации = СостоянияРегистрации.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиНазначенияРазгрузки КАК НастройкиНазначенияРазгрузки
	|		ПО ВагоныНаПутяхРегистрации.Номенклатура = НастройкиНазначенияРазгрузки.Номенклатура
	|		И ВагоныНаПутяхРегистрации.ПутьТочкаМаршрута = НастройкиНазначенияРазгрузки.ЯмаРазгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаПутяхДетальные.Вагон КАК Вагон,
	|	ВагоныНаПутяхДетальные.Путь КАК Путь,
	|	ВагоныНаПутяхДетальные.WaggonIndexPark КАК WaggonIndexPark,
	|	ВагоныНаПутяхДетальные.ДокументРегистрации КАК ДокументРегистрации,
	|	ВагоныНаПутяхДетальные.Номенклатура КАК Номенклатура,
	|	ВагоныНаПутяхДетальные.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВагоныНаПутяхДетальные.Состояние КАК Состояние,
	|	ВагоныНаПутяхДетальные.Силос КАК Силос
	|ИЗ
	|	ВагоныНаПутяхДетальные КАК ВагоныНаПутяхДетальные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Путь,
	|	WaggonIndexPark
	|ИТОГИ
	|	МАКСИМУМ(WaggonIndexPark)
	|ПО
	|	Путь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаПутяхДетальные.НоменклатураНаименование КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВагоныНаПутяхДетальные.Вагон) КАК НоменклатураКоличество,
	|	НЕОПРЕДЕЛЕНО КАК Состояние,
	|	НЕОПРЕДЕЛЕНО КАК СостояниеКоличество
	|ИЗ
	|	ВагоныНаПутяхДетальные КАК ВагоныНаПутяхДетальные
	|СГРУППИРОВАТЬ ПО
	|	ВагоныНаПутяхДетальные.НоменклатураНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаПутяхДетальные.Состояние КАК Состояние,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВагоныНаПутяхДетальные.Вагон) КАК СостояниеКоличество
	|ИЗ
	|	ВагоныНаПутяхДетальные КАК ВагоныНаПутяхДетальные
	|СГРУППИРОВАТЬ ПО
	|	ВагоныНаПутяхДетальные.Состояние";
		
КонецФункции

&НаСервере
Функция ОформлениеВагонаПоСостоянию(Состояние)
	
	ТолщинаЛинии = 3;
	Оформление = Новый Структура;
	Если Состояние = Перечисления.гкс_СостоянияРегистрации.Прибыл Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Бежевый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.СветлоЖелтый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.ВзятыПробы Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.ЗамшаСветлый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.ПринятыПробы Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Персиковый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.РезультатыПробПолучены Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Персиковый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Красный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.КачествоПринято Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.БледноЗеленый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.КачествоНеПринято Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Лосось);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Коричневый);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.ВыгрузкаРазрешена Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.БледноЛиловый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.Выгружен Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Золотой);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	ИначеЕсли Состояние = Перечисления.гкс_СостоянияРегистрации.Убыл Тогда 
		Оформление.Вставить("ЦветФона"	, WebЦвета.Голубой);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, ТолщинаЛинии));
	Иначе 
		Оформление.Вставить("ЦветФона"	, WebЦвета.СеребристоСерый);
		Оформление.Вставить("ЦветРамки"	, WebЦвета.Черный);
		Оформление.Вставить("Линия", Новый Линия(ТипЛинииРисункаТабличногоДокумента.ПунктирТочка, ТолщинаЛинии));
	КонецЕсли;
	
	Возврат Оформление;
	
КонецФункции

#КонецОбласти

#КонецОбласти
